{
  "zhamshid": {
    "name": "Zhamshid Abdulazizov",
    "role": "4263145",
    "autobiography": "I’m Zhamshid Abdulazizov, a student who grew up in Kazakhstan, where meals were as much about conversation and family rituals as about eating. I remember the long weekends when my family gathered around beshbarmak or baursaks, debating flavors, sharing stories, and sometimes playfully arguing over who added too much salt. From those moments, I realized that food is a lens for understanding people—what they value, how they remember, and how they connect. Cooking became my way to explore these dynamics personally: experimenting with traditional Kazakh dishes, introducing subtle twists, and seeing how friends respond. This curiosity led me to notice how recipes, ingredients, and preparation styles carry identity, memory, and social meaning.",
    "reflection": {
      "keyLearnings": "One key lesson I took from this course is that food is a map of culture, identity, and power. I learned that globalization and migration don’t just spread dishes—they reshape them. A dish from Kazakhstan, for example, can appear differently abroad, acquiring new meanings while still carrying a trace of its origin. I also noticed how language frames food: the way people name dishes, describe flavors, or tell cooking stories preserves identity and transmits memory across generations. Understanding these patterns revealed that even everyday meals are embedded in larger social and cultural systems.",
      "motto": "“Every dish carries a story.” This reminds me that cooking is more than technique; it’s communication. A family recipe, a street snack, or a holiday feast reflects history, relationships, and personal choices. Paying attention to these stories has deepened my appreciation for both my own roots and other cultures.",
      "applyingThemes": "I plan to apply these insights by observing how people use food to express identity and memory. At home, I’ll pay attention to how recipes evolve across generations; in my academic work, I’ll explore how dishes travel and adapt while retaining cultural significance. Food, for me, will remain a way to connect with others, uncover hidden histories, and understand culture in its lived, flavorful form."
    },
    "quote": "Food is memory mode tangible, tradition mode taste-able.",
    "photo": "zhamshid.jpg"
  },
  "shaxodat": {
    "name": "Shaxodat Alimova",
    "role": "4220491",
    "autobiography": "My name is Shaxodat Alimova, and I am a student with a strong interest in understanding how culture shapes the way people communicate, express identity, and connect with one another. Throughout my academic journey, I have become increasingly fascinated by how food tells stories about migration, belonging, and memory. Growing up in a multicultural environment has made me curious about the invisible ties between language and everyday practices such as cooking and eating.\nI enjoy exploring how people preserve their traditions through food and how new cultural identities emerge when recipes and languages travel across borders. This curiosity inspired me to study topics related to globalization and cultural exchange. Beyond academics, I value creativity, teamwork, and learning from different perspectives. I believe that food, like language, is a living form of expression that reflects who we are and where we come from. In the future, I hope to continue exploring cultural diversity and contribute to projects that promote cross-cultural understanding and respect through communication, storytelling, and education.",
    "reflection": {
      "keyLearnings": "One of the main lessons I have learned in this course is that food is not only a biological need but also a social and cultural language. Theories related to foodways helped me understand how food practices express identity and social relationships. I learned that what we eat, how we prepare it, and the words we use to describe it all reveal power structures and cultural histories. The concept of globalization showed how migration and cultural exchange influence food traditions—sometimes leading to hybrid cuisines or even cultural conflicts over authenticity. I also found the ideas about power important, especially how certain foods or cooking styles can be valued more because of social class, race, or colonial history.",
      "motto": "A guiding phrase I took from this course is: “Food is memory made visible.” This phrase reminds me that food is deeply emotional—it carries the stories of people, families, and places. Every recipe holds memories of migration, survival, and love. This idea is personally meaningful to me because food has always been a way for my family to stay connected to our cultural roots. It’s not only about taste, but also about remembering where we come from.",
      "applyingThemes": "I will apply what I learned about food, language, and identity by paying attention to how people express belonging through their cooking and storytelling. When migrants move to new countries, they often recreate traditional dishes as a way of keeping their culture alive. I want to explore how language is used in recipes, restaurant menus, and family conversations to preserve heritage and identity. In my future studies or career, I plan to continue examining how cultural exchange through food can build understanding between different communities. Food connects people beyond borders, and I believe that by studying these connections, we can promote empathy and appreciation for diversity."
    },
    "quote": "Recipes are the heirlooms we carry in our hearts.",
    "photo": "shaxodat.jpg"
  },
  "azimjon": {
    "name": "Azimjon Asatov",
    "role": "4216998",
    "autobiography": "Hello) I am Azimjon from Food Language and Identity. My name is Azimjon. I am senior Computer Science student at Webster. Despite technical nature of my major, I’ve always been interested in how food connects people to their culture and identity. After some time, I noticed how meals were more than just something to eat, they carried meaning, stories, and a sense of who we actually are. When I started learning about globalization and cultural exchange, I figured out that food travels and changes just like language does. One dish can show both history and adaptation, depending on who makes it and where.\nIn addition, my personal academic background helps me to see the foodways not just in traditions, I see them as systems of communication and even power. I enjoy studying or learning how recipes, taste, and cooking practices reveal something about society and relationships between people. Also, I like to cooking myself. For me it feels like a small act of keeping memory alive while at the same time also experimenting with new things. Overall, I see food as a way to understand both personal and global connections, and that’s why I’m drawn to studying it deeper.",
    "reflection": {
      "keyLearnings": "From this course, I’ve learned that food is simply nutrition, it’s a form of power, identity, and history. Some theories such as Bourdieu’s ideas of taste and Mintz’s work on sugar show and depict how food marks social class and historical exploitation. These readings helped me to understand that what people like eating and how they describe it reflects their position in systems of power and globalization.",
      "motto": "“Food is a language of belonging.” For me, it means that food speaks even when any sort of words fail. It tells who we are and where we come from, and it can also show how we find belonging in new places.",
      "applyingThemes": "I am planning to use what I learned about food, language, and identity in future projects or maybe even research. I’m especially very interested in how digital spaces can help preserve traditional food knowledge and share it across communities. Also, through writing, interviews, or storytelling, I want to explore how food can both protect culture and challenge inequality at the same time."
    },
    "quote": "In every recipe, we find the grammar of our heritage.",
    "photo": ""
  },
  "amir": {
    "name": "Amir Burkhanov Burxonov",
    "role": "4222834",
    "autobiography": "My name is Amir Burkhanov, and I am a student deeply interested in understanding how \nculture, language, and everyday practices shape identity and memory. Growing up in \nUzbekistan and now studying in an international environment, I have become fascinated by \nhow food carries stories about migration, belonging, and family history. For me, food is not \njust nourishment — it is a way to communicate, preserve memories, and connect with people \nacross cultures. \nI enjoy exploring how traditional dishes travel with people and change while keeping their \ncultural meaning. I am particularly interested in how bilingual cooking stories, family \nrecipes, and culinary traditions help migrants maintain their cultural identity in new \nenvironments. Beyond academics, I value curiosity, creativity, and learning from different \nperspectives. I believe that food, like language, is a living expression of who we are, where \nwe come from, and how we connect with others. In the future, I hope to continue exploring \ncultural diversity and contribute to projects that promote understanding and empathy through \nstorytelling, cooking, and shared experiences.",
    "reflection": {
      "keyLearnings": "Through this course, I learned that food is more than just something we eat — it is a system \nof cultural meaning that reflects identity, memory, and power. The work of Mintz, \nAppadurai, Heldke, and hooks helped me understand that what we cook, how we describe it, \nand how we share it all carry stories about family, place, and cultural history. I learned that \nmigration changes the way people cook and remember food, and that recipes, storytelling, \nand bilingual cooking practices help preserve heritage while adapting to new surroundings. I \nalso realized how globalization influences which foods are considered “authentic” and how \npower shapes whose food stories are heard.",
      "motto": "“Cooking is remembering.”",
      "applyingThemes": "I will use these lessons both in my academic work and daily life. Academically, I want to \nexplore how migrant communities use food and language to maintain cultural identity, \nparticularly through intergenerational storytelling and bilingual recipes. In everyday life, I try \nto celebrate cultural diversity by learning original dish names, sharing meals, and \nappreciating the stories behind each recipe. This course taught me that eating is not just \nconsumption — it is communication, empathy, and a way to build identity and connection \nacross borders."
    },
    "quote": "A recipe has no soul. You, as the cook, must bring soul to the recipe.",
    "photo": "amir.jpg"
  },
  "artur": {
    "name": "Artur Krasnogorov",
    "role": "4221856",
    "autobiography": "My name is Artur. Four years ago I was a professional volleyball player; now I balance several tasks: coach and founder of my volleyball league and academy, service consultant at BYD, and student of computer science with keen interest in back-end development like Java, Go, PHP and AI automation. I like to teach kids volleyball, learning new skills, and explore the topics of sustainability, citizen journalism, and new challenges in the field of cybersecurity. Besides that, I am pursuing a master of Data Science and AI with the goal of Politecnico di Milano and still play volleyball and train in the gym. I am generally interested in sport, technology, sustainability and education: to me, it is necessary to unite the practice - on the court and with theory - in the classroom, creating something valuable to individuals and communities.",
    "reflection": {
      "keyLearnings": "During this course we have learned the intersections between foodways, the systematic patterns of the ways people obtain, prepare, share, and eat food, and identity, power, and globalization. Among the key theoretical lessons, the fact that food is not just biological sustenance, but a highly symbolic phenomenon must be mentioned: food creates cultural identity, expresses social status, strengthens group membership, and serves as a power terrain.\nWe also came to know how globalisation and migration are transforming food identities: food can travel, get mixed up, local food culture comes under the influence of global food culture, but food is also a place of resistance and belonging.",
      "motto": "What you eat speaks more than your diet - it tells your story.\nThis expression is a reminder to me that my personal background is not merely represented in what I do, but also in how I interact with culture, community and knowledge. Similar to food, there is memory, identity and power, and I envision my courses as a blend of various ingredients (volleyball, software, sustainability, education) into a significant recipe of difference.",
      "applyingThemes": "I have already experienced how culture, communication and identity relate through my volleyball league and academy and my role as a coach: children with different backgrounds gather, bring their food culture, their language, their methods of sharing. The knowledge of food, language and identity relationships assists me in creating inclusive settings in which diversity based on culture is celebrated. I will use this awareness in further software development (billing systems, management platforms) by designing tools that would take into account multilingual users, cultural variations, and social power relations (how access to food or sports training can be mediated by class or gender). In all my work as coach, consultant, student, I will be informed by the idea that our everyday practices (what we eat, how we share, how we talk, and so on) inform our identities and our power relations and therefore, designing wisely means knowing the cultural grid behind a simple act, such as having a meal."
    },
    "quote": "Food is the ingredient that binds us together.",
    "photo": "artur.jpg"
  },
  "asila": {
    "name": "Asila Azizbekova",
    "role": "4246429",
    "autobiography": "My name is Asila Azizbekova, and I am a student deeply interested in the intersections of culture, identity, and communication. I was born and raised in Uzbekistan, a country whose cuisine reflects a mosaic of influences shaped by trade, migration, and shared memories. Growing up in such a culturally diverse environment made me realize how food is never just food — it is language, emotion, and memory blended into one.\n\nThroughout my academic journey, I have been fascinated by how people express belonging and nostalgia through what they cook and share. This curiosity led me to study the ways migration reshapes culinary traditions and how language preserves the emotional connection between people and their homeland.\n\nBeyond academics, I consider myself a creative and reflective person who enjoys exploring different art forms and finding meaning in small details of everyday life. Working on this project has been an opportunity to connect theory with lived experience — to see how the stories we tell through food become a part of who we are. I hope to continue studying global culture and communication, aiming to build bridges between people through understanding and shared human experiences.",
    "reflection": {
      "keyLearnings": "Throughout this course, I have come to understand how food operates not only as a means of survival but as a complex cultural language that carries identity, power, and memory. Theories of foodways and globalization helped me see that migration transforms not only where people live but also what and how they eat. For example, when families adapt recipes to new ingredients abroad, they preserve emotional roots while reshaping their identities. I realized that food often becomes a quiet resistance — a way for people to claim belonging when words fall short. The connections between food and power also became clear: who gets to define “authentic” cuisine, and whose traditions are overlooked, reveal deeper inequalities in global culture.",
      "motto": "“Every meal tells a story — of memory, movement, and meaning.”\nThis phrase resonates with me because it reminds me that food holds layers of history, emotion, and migration. It reflects the course’s spirit — to look beyond ingredients and recipes, and see the human stories beneath them. It also aligns with my personal belief that identity is something we taste and feel, not just describe.",
      "applyingThemes": "I plan to carry this understanding into my everyday life and future career. Whether in communication, cultural studies, or travel, I will approach food as a bridge that connects people beyond language barriers. This course taught me to listen to the “language” of food — how it expresses care, nostalgia, and resilience. When I encounter different cuisines, I will no longer see them as merely “foreign,” but as stories of migration, adaptation, and belonging.\nUltimately, this course has deepened my appreciation for diversity and human connection — showing that food is not only what we share on the table, but also what binds our memories and identities together."
    },
    "quote": "Food is the anchor that holds us to our past and the sail that carries us to new shores.",
    "photo": "asila.jpg"
  },
  "asilbek": {
    "name": "Asilbek Asatov",
    "role": "4218073",
    "autobiography": "My name is Asilbek Asatov, but most people know me simply as Asil. I was born and raised in Uzbekistan, and from a young age I learned the value of independence. I began earning my own money at 17, and that early responsibility shaped my character. At 19, I bought my first car, proving to myself that discipline and ambition always bring results.\n\nI study Business Administration at Webster University in Tashkent, where I am building the foundation for my long-term dream of becoming a successful entrepreneur. I believe business should create real value, help people, and leave a meaningful impact on the world.\n\nSports have also shaped who I am. I have experience in swimming, football, and ping pong, and one of my proudest moments was leading my team to victory in the Webster football tournament during my freshman year.\n\nToday, I work at Skyeng as the Head of the Sales Department. This role helps me grow as a leader, improve my communication skills, and understand how to manage people and processes effectively. I believe every day brings me closer to the person I want to become — someone who builds, leads, and inspires.",
    "reflection": {
      "keyLearnings": "",
      "motto": "",
      "applyingThemes": ""
    },
    "quote": "To eat is a necessity, but to eat intelligently is an art.",
    "photo": "asil.jpg"
  },
  "aziz": {
    "name": "Aziz Axmedzyanov",
    "role": "4204787",
    "autobiography": "",
    "reflection": {
      "keyLearnings": "",
      "motto": "",
      "applyingThemes": ""
    },
    "quote": "We all eat, and it would be a sad waste of opportunity to eat badly.",
    "photo": ""
  },
  "jonibek": {
    "name": "Jonibek Erkinov",
    "role": "4226162",
    "autobiography": "",
    "reflection": {
      "keyLearnings": "",
      "motto": "",
      "applyingThemes": ""
    },
    "quote": "Food brings people together on many different levels.",
    "photo": "jonibek.jpg"
  },
  "kozimbek": {
    "name": "Kozimbek Aminov",
    "role": "4220381",
    "autobiography": "My name is Kozimbek Aminov, and I am currently studying at Webster University. Although my major is Computer Science and my academic focus is primarily shaped by technology, this course has encouraged me to look at food not from an agricultural or industrial perspective—which is not an area I am deeply familiar with—but rather through psychological and cultural lenses. My interest tends to gravitate toward how people think, behave, and express identity, rather than toward the technical aspects of food production or agricultural systems.\n\nThroughout my academic journey, it gradually became clear to me that food can serve as a reflection of migration, belonging, and collective memory. Growing up in a multicultural environment exposed me to the subtle connections between language, daily practices, and the emotional significance of cooking and sharing meals. This perspective has led me to view food less as a product of industry and more as a medium through which individuals preserve traditions and form new cultural identities when recipes and languages move across borders.\n\nThis curiosity encouraged me to pay attention to processes such as globalization and cultural exchange, even if I do not approach them from an agrarian standpoint. I am more drawn to the psychological and social implications—how people adapt, what they choose to preserve, and how identity is communicated through food and storytelling. I also value creativity, collaboration, and learning from multiple viewpoints. For me, food functions much like language: it is a dynamic form of expression that reveals who we are and where we come from. In the future, I hope to contribute to projects that support cross-cultural understanding through communication, narrative, and education.",
    "reflection": {
      "keyLearnings": "One of the most important insights gained from this course is that food is not only a biological necessity but also a social and cultural language. The theories discussed helped me understand that eating habits reveal identity, social relationships, and deeper structures of meaning. Even though I am less knowledgeable about the agricultural or industrial aspects of food systems, the psychological dimension—how people attach meaning to food and how their choices express belonging—felt more intuitive to me.\nThe concept of globalization demonstrated how migration and cultural interaction reshape culinary traditions, sometimes creating hybrid cuisines or debates over authenticity. Ideas related to power also stood out, especially how certain foods or cooking styles are valued due to social class, race, or colonial history.",
      "motto": "“Food is memory made visible.”\nThis idea emphasizes the emotional and psychological layers of food. Every recipe carries memories of movement, survival, and identity. Although I am not deeply involved in agricultural studies, this perspective helped me see that food is not only about its material production but also about the memories and meanings people attach to it. For my family, food has always been a way to stay connected to our cultural roots — not just through taste, but through the stories and emotions it brings.",
      "applyingThemes": "I plan to apply what I learned by paying attention to how individuals express belonging through cooking, storytelling, and the language surrounding food. While I may not analyze food systems from an agrarian or industrial standpoint, I am interested in how migrants recreate traditional dishes to maintain their identity and how language in recipes, menus, and family conversations helps preserve cultural heritage.\nIn my future studies or career, I hope to continue exploring how cultural exchange through food can build bridges between communities. Food brings people together beyond borders, and by examining these psychological and cultural connections, we can foster empathy and appreciation for diversity"
    },
    "quote": "The secret of success in life is to eat what you like and let the food fight it out inside.",
    "photo": "photo_2025-11-14_10-48-26.jpg"
  },
  "nodirbek": {
    "name": "Nodirbek Erkinov",
    "role": "4209825",
    "autobiography": "My name is Erkinov Nodirbek, and I am currently a senior student at Webster University, majoring in International Relations. Ever since my childhood, I have been driven by a strong desire to improve myself and broaden my horizons. Growing up, I was passionate about football, which taught me discipline and teamwork, and I also enjoyed learning the English language, a skill that opened many doors for me later in life.\n\nOne of the milestones in my personal development was starting my own YouTube channel. Creating content and speaking in front of an audience significantly boosted my confidence and helped me express my ideas more clearly. Throughout school, I was a dedicated student and consistently earned strong grades, which motivated me to aim higher in my academic journey.\n\nAfter graduating from school, I enrolled at Westminster Lyceum, where I continued to challenge myself both academically and personally. Later, I had the incredible opportunity to study in China through a language program. This experience exposed me to a new culture, broadened my worldview, and strengthened my interest in international affairs.\n\nNow, as I approach graduation from Webster University, I am eager to continue my academic path abroad and pursue a Master’s degree, aiming to further develop my skills and contribute to the global community.",
    "reflection": {
      "keyLearnings": "",
      "motto": "",
      "applyingThemes": ""
    },
    "quote": "Life is uncertain. Eat dessert first.",
    "photo": "nodir.jpg"
  },
  "shohruxbek": {
    "name": "Shohruxbek Ahmadjonov",
    "role": "4253474",
    "autobiography": "My name is, Shohruxbek Ahmadjonov, i was born and grew up in Tashkent but my parents are from Andizhan which is one part of Uzbekistan's Valley. Where the meals are such tasty and very cheap compared to our Capital. So the Andizhan is very popular because of its Pallov (Osh), it's considered that, the best pallov is in Andizhan by majority of people. The meals are one of our key parts of personal lives, as people eat their daily foods by their attitudes, so mine would be Any Uzbek traditional food with less oil.",
    "reflection": {
      "keyLearnings": "In this course i learned that, its compulsary to know the types and benefits of what we consume everyday. That every culture has its own meal that, it can be liked by anyone else who first time tastes it, and additionally got that we should respect any cultures meals doesn't matter to which nationality the meal belongs. Memory, Language of Home Cooking and even Memory shows how food is getting important in our life far more than just sustenance, that it changes into the bridge in the middle of present and past, so that new beginnings and homeland. For the migrants, cooking is usually an act of remembrance if we look clearly, its the way to preserve the cultural ways and identities in foreign places where many things even everything else can feel unfamiliar. Every recipe carries about the echoes of family stories, can be even sensory memories which account emotional connections over borders. From the rhymths of tasting, chopping to sharing. In addition the migrants re-create fragments of the house, and translating the memory into the belonging and memory.",
      "motto": "\"Every dish is a story carried across borders\" This motto captures how migration transforms food into a language of memory—each meal holding pieces of where we come from, what we’ve left behind, and what we carry forward. It reflects the idea that cooking is not just preparing food, but preserving identity, history, and family through taste and tradition.",
      "applyingThemes": "At the same time, the language of home cooking evolves, As the migrants are adapted and can adapt to the new local influences, dishes change, also ingredients effecting the dynamic nature of identity itself. This blending represents of how that culture is not static - it travels, transforms and survives over the creativity and care. Ultimately, the kitchen becomes a powerful site of resistance and renewal a place where memory is not lost but reborn through every shared meal. Thus, home cooking stands as both a personal and collective archive—a living testament to how migration reshapes who we are, while still allowing us to taste where we come from."
    },
    "quote": "One cannot think well, love well, sleep well, if one has not dined well.",
    "photo": "shohrux.jpg"
  },
  "temur": {
    "name": "Temur Aliev",
    "role": "4195521",
    "autobiography": "My name is Temur Aliev, and I am a senior student majoring in International Relations at Webster University. Growing up in Uzbekistan, I developed a deep appreciation for how food, language, and culture are intertwined. From family meals to community celebrations, I noticed early on that food is more than sustenance — it carries stories, traditions, and emotions.\n\nAs a child, I watched my family prepare traditional dishes such as plov and shurpa during holidays. These meals were moments of connection and cultural transmission, where recipes, stories, and laughter were shared across generations. Even as I traveled and studied abroad, I realized that food can bridge cultural differences, creating understanding between people from diverse backgrounds.\n\nCooking became a way for me to maintain my Uzbek identity while exploring other cultures. I enjoy experimenting with traditional dishes by adding contemporary influences and learning about cuisines from around the world. Academically, I am fascinated by how migration, globalization, and language intersect with culinary practices to shape both personal and collective identities.\n\nThis course, Food, Language, and Identity, has helped me understand that cooking and sharing food are forms of cultural communication. Food is a universal language, one that allows us to express memory, heritage, and connection (Mintz, 1985; Appadurai, 1988).",
    "reflection": {
      "keyLearnings": "Through this course, I learned that food is a system of cultural meaning that reflects relationships between identity, memory, and power. Mintz (1985) demonstrates that food practices are shaped by historical, economic, and social systems, influencing how communities identify themselves. Appadurai (1988) emphasizes that cuisines are dynamic and constantly evolving, shaped by migration, globalization, and cultural exchange.\n\nLanguage is equally important. How people describe meals, translate recipes, or share culinary stories shows how culture and identity are maintained or transformed. Heldke (2003) highlights the concept of cultural food adventurism, while hooks (1992) warns us to consider whose story is being told. These insights taught me that food is both a personal and political act, capable of empowerment or exclusion depending on context.\n\nBy studying these perspectives, I now understand that food is not just nourishment — it is a way to tell stories, share history, and build human connection.",
      "motto": "“Through food, we remember and belong.”",
      "applyingThemes": "I will apply the lessons from this course in both academic research and daily life. Academically, I aim to study how migrant communities use food and language to preserve cultural identity, especially across generations. I am particularly interested in how recipes, cooking practices, and culinary stories shared online or in families help sustain cultural memory.\n\nIn everyday life, I practice cultural curiosity and sharing. I try to learn the history and original names of dishes, share meals with friends from different backgrounds, and treat cooking as an act of communication, empathy, and identity-building.\n\nThis course has changed the way I view food: it is more than consumption — it is a medium to connect, remember, and express who we are. Through cooking, I feel both rooted in my heritage and open to the world."
    },
    "quote": "For me, every meal is a story.",
    "photo": ""
  }
}
